package Java1.Lesson5;

public class HomeWork5 {

    /*
    1. Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, зарплата, возраст.
    2. Конструктор класса должен заполнять эти поля при создании объекта.
    3. Внутри класса «Сотрудник» написать метод, который выводит информацию об объекте в
    консоль.
    4. Создать массив из 5 сотрудников.
    Пример:
    Person[] persArray = new Person[5]; // Вначале объявляем массив объектов
    persArray[0] = new Person("Ivanov Ivan", "Engineer", "ivivan@mailbox.com", "892312312",
    30000, 30); // потом для каждой ячейки массива задаем объект
    persArray[1] = new Person(...);
    ...
    persArray[4] = new Person(...);
    5. С помощью цикла вывести информацию только о сотрудниках старше 40 лет.
     */

    public static void main(String[] args) {

        Employee[] employee = {
                new Employee("Евгений", "Менеджер", "emp1@gmail.com", "89370001111", 50000, 28),
                new Employee("Виталий", "Менеджер", "emp2@gmail.com", "89370002222", 55000, 35),
                new Employee("Алексей", "Менеджер", "emp3@gmail.com", "89370003333", 45000, 28),
                new Employee("Илья", "Кладовщик", "emp4@gmail.com", "89370004444", 35000, 31),
                new Employee("Александра", "Офис-менеджер", "emp5@gmail.com", "89370005555", 35000, 32)
        };

        for (int i = 0; i < employee.length; i++) {
            employee[i].employeeInfo();
        }

        System.out.printf("\nСотрудники старше 30 лет:\n");
        for (int i = 0; i < employee.length; i++) {
            if (employee[i].getAge() >= 30) {
                System.out.println(employee[i].getName());
            }
        }
    }
}
